# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 
 
a = int(input('Введите число: '))

c = []
a0 = 0 
a1 = 1
i = 0
while i <= a:
    c.append(a0)
    x = a0+a1; 
    a0 = a1
    a1 = x
    i += 1

b = []
a0 = 1 
a1 = -1
i = 0
while i < a:
    b.append(a0)
    x = a0-a1; 
    a0 = a1
    a1 = x
    i += 1
list.reverse(b)
b.extend(c)
print(b)